brew "deno"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "htop"
brew "kanata"
brew "lima"
brew "lsd"
brew "node"
brew "ripgrep"
brew "rustup"
brew "unar"
brew "ffmpeg"

cask "font-jetbrains-mono"
cask "hammerspoon"
cask "karabiner-elements"
cask "mullvadvpn"
cask "obs"
cask "qbittorrent"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zed"
cask "keymapp"
cask "whisky"
# cask "intellij-idea"
