bbenoist.Nix
bodil.file-browser
eamodio.gitlens
emeraldwalk.RunOnSave
geddski.macros
jsynowiec.vscode-insertdatestring
julialang.language-julia
kahole.magit
kaiwood.center-editor-window
lucax88x.codeacejumper
matklad.pale-fire
matklad.rust-analyzer
ms-vscode.cpptools
ritwickdey.LiveServer
ryu1kn.edit-with-shell
stkb.rewrap
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
vadimcn.vscode-lldb
wmaurer.change-case
yo1dog.cursor-align
ziyasal.vscode-open-in-github
