alygin.vscode-tlaplus
arzg.intellij-theme
arzg.xcode-theme
asciidoctor.asciidoctor-vscode
bbenoist.Nix
eamodio.gitlens
emeraldwalk.RunOnSave
geddski.macros
iliazeus.vscode-ansi
jsynowiec.vscode-insertdatestring
kahole.magit
kaiwood.center-editor-window
matklad.open-notes
matklad.pale-fire
mksafi.find-jump
ms-vscode.cpptools
oijaz.unicode-latex
ritwickdey.LiveServer
rust-lang.rust-analyzer
ryu1kn.edit-with-shell
stkb.rewrap
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
vadimcn.vscode-lldb
wmaurer.change-case
yo1dog.cursor-align
ziyasal.vscode-open-in-github
