asciidoctor.asciidoctor-vscode
bbenoist.Nix
emeraldwalk.RunOnSave
geddski.macros
joaompinto.asciidoctor-vscode
jsynowiec.vscode-insertdatestring
julialang.language-julia
kahole.magit
kaiwood.center-editor-window
lucax88x.codeacejumper
matklad.pale-fire
matklad.rust-analyzer
ms-vscode.cpptools
ritwickdey.LiveServer
slevesque.vscode-multiclip
stkb.rewrap
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-russian
tht13.html-preview-vscode
vadimcn.vscode-lldb
wmaurer.change-case
wwm.better-align
ziyasal.vscode-open-in-github
